Repository: harrmitch/flatpak-docs
Catalog: po/*/LC_MESSAGES/building-introduction.po
Languages: vi

source: Building Introduction
vi: Tổng quan về xây dựng (Building Introduction)

source: :doc:`first-build` has already provided a quick demonstration of how applications get built with Flatpak. This page provides an additional general overview of what's involved.
vi: :doc:`first-build` đã minh họa nhanh về cách xây dựng các ứng dụng với Flatpak. Trang này cung cấp thêm thông tin tổng quan chung về những gì liên quan.

source: ``flatpak-builder`` is the primary tool for building Flatpak applications. It allows you to take the source files for an application and build it into a Flatpak application. It also allows multiple other dependencies to be built at the same time, which get bundled into the build.
vi: ``flatpak-builder`` là công cụ chính để xây dựng các ứng dụng Flatpak. Nó cho phép bạn lấy các tệp nguồn của một ứng dụng và xây dựng nó thành ứng dụng Flatpak. Nó cũng cho phép xây dựng nhiều dependency khác cùng lúc, để đóng gòi kèm vào bản dựng.

source: The input to ``flatpak-builder`` is a manifest file. This specifies the parameters for the application that will be built, such as its name and which runtime it will depend on. The manifest also lists all the modules that are to be built as part of the build process. A source for each module can be specified, including links to file archives or version control repositories. One of the modules (usually the last one) is the application code itself.
vi: Đầu vào ``flatpak-builder`` là một tệp kê khai (manifest). Nó chỉ định các tham số (parameters) cho ứng dụng sẽ được xây dựng, chẳng hạn như tên của nó và runtime mà nó sẽ phụ thuộc vào. Tệp kê khai cũng liệt kê tất cả các mô-đun (module) sẽ được dựng trong quá trình xây dựng. Nguồn cho mỗi mô-đun có thể được chỉ định, bao gồm các liên kết đến các tệp lưu trữ (file archive) hoặc các kho quản lí phiên bản (version control repository). Một trong các mô-đun (thường là mô-đun cuối cùng) chính là mã ứng dụng (application code).

source: The basic format used to invoke ``flatpak-builder`` is::
vi: Dạng cơ bản được sử dụng để gọi ``flatpak-builder`` là::

source: Where ``<build-dir>`` is the path to the directory that the application will be built into, and ``<manifest>`` is the path to a manifest file. The contents of ``<build-dir>`` can be useful for testing and debugging purposes, but is generally treated as an artifact of the build process.
vi: Với ``<build-dir>`` là đường dẫn đến thư mục mà ứng dụng sẽ được xây dựng vào, và ``<manifest>`` là đường dẫn đến tệp kê khai. Nội dung của ``<build-dir>`` có thể hữu ích cho mục đích thử nghiệm và gỡ lỗi, nhưng thường được coi là một artifact (sản phẩm/tạo tác) của quá trình xây dựng.

source: When ``flatpak-builder`` is run:
vi: Khi ``flatpak-builder`` được chạy:

source: The build directory is created, if it doesn't already exist
vi: Thư mục bản dựng được tạo nếu nó chưa tồn tại

source: The source code for each module is downloaded and verified
vi: Mã nguồn của từng mô-đun được tải xuống và xác minh

source: The source code for each module is built and installed
vi: Mã nguồn của từng mô-đun được xây dựng và cài đặt

source: The build is finished by setting sandbox permissions
vi: Quá trình xây dựng hoàn tất bằng việc đặt các quyền cho hộp cát (sandbox)

source: The build result is exported to a repository (which will be created if it doesn't exist already)
vi: Kết quả xây dựng được xuất sang một kho lưu trữ (sẽ được tạo nếu nó chưa tồn tại)

source: The application can then be installed from the repository and run.
vi: Sau đó, ứng dụng có thể được cài đặt từ kho lưu trữ và khởi chạy.

source: Software Development Kits (SDKs)
vi: Bộ công cụ phát triển phần mềm (SDK)

source: Instead of being built using the host environment, Flatpak applications are built inside a separate environment, called an SDK.
vi: Thay vì được xây dựng trên môi trường máy chủ, các ứng dụng Flatpak được dựng bên trong một môi trường riêng biệt, gọi là SDK.

source: SDKs are like the regular runtime that applications run in. The difference is that SDKs also include all the development resources and tools that are required to build an application, such as build and packaging tools, header files, compilers and debuggers.
vi: SDK giống như các runtime thông thường mà các ứng dụng chạy trong. Điểm khác biệt là SDK cũng bao gồm tất cả các tài nguyên và công cụ phát triển cần thiết để xây dựng một ứng dụng, chẳng hạn như công cụ xây dựng và đóng gói (build and packaging tool), tệp tiêu đề (header file), trình biên dịch (compiler) và trình gỡ lỗi (debugger).

source: Each runtime has an accompanying SDK. For example, there is both a GNOME 43 runtime and a GNOME 43 SDK. Applications that use the runtime are built with the matching SDK.
vi: Mỗi runtime đều có một SDK đi kèm. Ví dụ: có cả Gnome 43 runtime và Gnome 43 SDK. Các ứng dụng sử dụng runtime này được xây dựng bằng chính SDK ăn khớp ấy.

source: Like runtimes, SDKs will sometimes be automatically installed for you, but if you do need to manually install them, they are installed in the same way as applications and runtimes, such as::
vi: Giống như runtime, SDK đôi khi sẽ được tự động cài đặt cho bạn, nhưng nếu bạn cần cài đặt chúng theo cách thủ công thì chúng được cài đặt tương tự như các ứng dụng và runtime, chẳng hạn như::
