Repository: harrmitch/flatpak-docs
Catalog: po/*/LC_MESSAGES/flatpak-builder.po
Languages: vi

source: Flatpak Builder
vi: Flatpak Builder (Trình tạo Flatpak)

source: ``flatpak-builder`` has already been introduced in :doc:`first-build` and :doc:`building-introduction`. This page provides additional detail on how to use ``flatpak-builder``, including the various command options that are available.
vi: ``flatpak-builder`` đã được giới thiệu trong :doc:`first-build` và :doc:`building-introduction`. Trang này cung cấp thêm chi tiết về cách sử dụng ``flatpak-builder``, bao gồm các tùy chọn lệnh khác nhau có sẵn.

source: Exporting
vi: Xuất ứng dụng (Exporting)

source: ``flatpak-builder`` provides two options for exporting an application in order to run it. The first is to export to a repository, from which the application can be run. The second is to automatically install locally.
vi: ``flatpak-builder`` cung cấp hai tùy chọn để xuất một ứng dụng. Đầu tiên là xuất sang một kho lưu trữ (repository), từ đó ứng dụng có thể được chạy. Thứ hai là tự động cài đặt cục bộ.

source: Exporting to a repository
vi: Xuất sang kho lưu trữ

source: The ``--repo`` option allows a repository to be specified, for the application to be exported to. This takes the format::
vi: Tùy chọn ``--repo`` cho phép một kho lưu trữ được chỉ định để ứng dụng được xuất sang. Nó có dạng::

source: Here, ``<repo>`` is a path to a repository. If no repository exists at the specified location, the repository will be created. If the application is already in the specified repository, ``flatpak-builder`` will add the build as a new version of the existing application.
vi: Ở đây, ``<repo>`` là một đường dẫn đến một kho lưu trữ. Nếu không có kho lưu trữ nào tồn tại ở vị trí được chỉ định, một kho lưu trữ sẽ được tạo. Nếu ứng dụng đã có trong kho lưu trữ được chỉ định, ``flatpak-builder`` sẽ thêm bản dựng dưới dạng một phiên bản mới của ứng dụng hiện có.

source: You can put more than one application in the same repository by using the same ``--repo`` path for multiple invocations of ``flatpak-builder``.
vi: Bạn có thể đặt nhiều hơn một ứng dụng vào trong cùng một kho lưu trữ bằng cách sử dụng cùng một đường dẫn ``--repo`` cho các lần gọi ``flatpak-builder``.

source: By default, ``flatpak-builder`` splits off translations and debug information into separate `.Locale` and `.Debug` extensions. These extensions are automatically exported into a repository along with the application.
vi: Theo mặc định, ``flatpak-builder`` tách các bản dịch và thông tin gỡ lỗi thành các phần mở rộng (extension) `.Locale` và `.Debug` riêng biệt. Các phần mở rộng này được tự động xuất vào kho lưu trữ cùng với ứng dụng.

source: Installing builds directly
vi: Cài đặt bản dựng trực tiếp

source: Instead of exporting to a repository, the Flatpak that is produced by ``flatpak-builder`` can be automatically installed locally, using the ``--install`` option::
vi: Thay vì xuất sang kho lưu trữ, Flatpak được sản xuất bởi ``flatpak-builder`` có thể được tự động cài đặt cục bộ, sử dụng tùy chọn ``--install``::

source: This approach has the advantage of skipping the separate install step that is needed when exporting to a repository.
vi: Cách này có ưu điểm là bỏ qua bước cài đặt riêng biệt cần thiết khi xuất sang kho lưu trữ.

source: Signing
vi: Kí (Signing)

source: Every commit to a Flatpak repository should be signed with a GPG signature. If ``flatpak-builder`` is being used to modify or create a repository, a GPG key should therefore be passed to it. This can be done with the ``--gpg-sign`` option, such as::
vi: Mọi commit tới kho lưu trữ Flatpak phải được ký bằng chữ ký GPG (GPG signature). Do đó, nếu ``flatpak-builder`` đang được sử dụng để sửa đổi hoặc tạo kho lưu trữ, cần chuyển cho nó khóa GPG. Việc này có thể được thực hiện với tùy chọn ``--gpg-sign``, chẳng hạn như::

source: Here, ``<key>`` is the ID of the GPG key that is to be used. The ``--gpg-homedir`` option can also be used to specify the home directory of the key that is being used.
vi: Ở đây, ``<key>`` là ID của khóa GPG sẽ được sử dụng. Tùy chọn ``--gpg-homedir`` cũng có thể được sử dụng để chỉ định thư mục nhà (home directory) của khóa đang được sử dụng.

source: Though it generally isn't recommended, it is possible not to use GPG verification. In this case, the ``--no-gpg-verify`` option should be used when adding the repository. Note that it is necessary to become root in order to update a repository that does not have GPG verification enabled.
vi: Mặc dù nó thường không được khuyến khích, có thể không sử dụng xác minh GPG. Trong trường hợp này, nên sử dụng tùy chọn ``--no-gpg-verify`` khi thêm kho lưu trữ. Lưu ý rằng cần phải trở thành root để cập nhật kho lưu trữ mà xác minh GPG không được bật.
