Repository: harrmitch/flatpak-docs
Catalog: po/*/LC_MESSAGES/introduction.po
Languages: vi

source: Introduction to Flatpak
vi: Giới thiệu về Flatpak

source: Flatpak is a framework for distributing desktop applications across various Linux distributions. It has been created by developers who have a long history of working on the Linux desktop, and is run as an independent open source project.
vi: Flatpak là một framework (tạm dịch là "bộ khung") giúp phân phối các ứng dụng máy tính trên nhiều bản phân phối Linux khác nhau. Nó được tạo ra bởi các nhà phát triển làm việc lâu năm với nền tảng Linux trên máy tính (Linux desktop) và được điều hành như một dự án nguồn mở độc lập.

source: Terminology
vi: Thuật ngữ

source: Flatpak: a system for building, distributing, and running sandboxed desktop applications on Linux.
vi: Flatpak: một hệ thống xây dựng, phân phối và chạy các ứng dụng trong hộp cát (sandboxed) trên Linux.

source: Flatpak application: these are the applications the user installs via the ``flatpak`` command or via a different UI like GNOME Software or KDE Discover.
vi: Ứng dụng Flatpak: đây là các ứng dụng người dùng cài đặt qua lệnh ``flatpak`` hoặc qua một giao diện người dùng (UI) khác như GNOME Software hoặc KDE Discover.

source: Runtime: also called platforms, these are integrated platforms to provide basic utilities needed for a Flatpak application to work.
vi: Runtime: còn gọi là các nền tảng (platform), đây là những nền tảng tích hợp nhằm cung cấp những tiện ích cơ bản cần thiết cho hoạt động của ứng dụng Flatpak.

source: BaseApp: these are integrated platforms for frameworks like Electron.
vi: BaseApp: đây là những nền tảng tích hợp cho các framework như Electron.

source: Flatpak bundle: a specific single-file export format which contains a Flatpak app or runtime.
vi: Gói Flatpak: định dạng xuất (export format) chỉ riêng một tệp có chứa một ứng dụng hoặc một Flatpak runtime.

source: Target audience
vi: Đối tượng khán giả

source: Flatpak can be used by all kinds of desktop applications, and aims to be as agnostic as possible regarding how applications are built. There are no requirements regarding which programming languages, build tools, toolkits or frameworks can be used.
vi: Flatpak có thể được sử dụng bởi tất cả các loại ứng dụng máy tính và được thiết kế để không phụ thuộc nhất có thể về cách ứng dụng được xây dựng (build). Không có yêu cầu nào về ngôn ngữ lập trình, công cụ xây dựng (build tool), bộ công cụ (toolkit) hoặc framework có thể được sử dụng.

source: While Flatpak only runs on Linux, it can be used by applications that target other operating systems, as well as those that are Linux-specific. Applications can be open source or proprietary (although some distribution services, like `Flathub <https://flathub.org/>`_, can have restrictions in this respect).
vi: Mặc dù Flatpak chỉ chạy trên Linux nhưng nó có thể được sử dụng bởi các ứng dụng nhắm vào các hệ điều hành khác, cũng như các ứng dụng dành riêng cho Linux. Các ứng dụng có thể là nguồn mở hoặc độc quyền (mặc dù một số dịch vụ phân phối, như `Flathub <https://flathub.org/>`_, có thể có những hạn chế về mặt này).

source: The only technical requirements made by Flatpak are that applications follow a small number of Freedesktop standards, in order to enable desktop integration (see :doc:`conventions`).
vi: Yêu cầu kỹ thuật duy nhất được Flatpak đưa ra là các ứng dụng phải tuân theo một số ít tiêu chuẩn của Freedesktop để có thể tích hợp với môi trường desktop (desktop integration) (xem :doc:`conventions`).

source: Issues of current model of packaging
vi: Những vấn đề của các mô hình đóng gói ứng dụng hiện nay

source: It is important to understand the problems of the current model of packaging applications to understand the existence of Flatpak:
vi: Muốn hiểu được sự tồn tại của Flatpak thì điều quan trọng là phải hiểu được những vấn đề liên quan tới các mô hình đóng gói ứng dụng đang hiện hành:

source: **Duplicated work packaging apps**: many Linux distributions come with their own package manager, package format and repository. This requires a lot of maintainers to package the same application in various distributions, or the application developer to learn the language of each format and then package the application in those distributions, or ignore most distributions and package and support a couple of distributions. This makes the Linux desktop a difficult platform for software vendors to target.
vi: **Trùng lặp công việc (duplicated work)**: nhiều bản phân phối Linux có trình quản lý gói, định dạng gói và repository (kho lưu trữ) riêng. Việc này đòi hỏi nhiều nhà bảo trì (maintainer) phải đóng gói cùng một ứng dụng trong nhiều bản phân phối khác nhau, hoặc nhà phát triển ứng dụng phải tìm hiểu ngôn ngữ của từng định dạng rồi đóng gói ứng dụng trong các bản phân phối đó, hoặc bỏ qua hầu hết các bản phân phối và chỉ đóng gói và hỗ trợ một số bản phân phối. Điều này làm cho Linux desktop khó nhắm tới đối với các nhà cung cấp phần mềm (software vendor).

source: **Limited to apps that are packaged**: not all applications are natively available in every Linux distribution. If an application is not available in a specific distribution, the user will have to rely on manually downloading the archive of the application, extracting it and hoping the application will launch.
vi: **Bị giới hạn về các ứng dụng được đóng gói**: không phải tất cả các ứng dụng đều có sẵn trên mọi bản phân phối Linux. Nếu một ứng dụng không có sẵn trên một bản phân phối cụ thể, người dùng sẽ phải tải xuống thủ công bản lưu trữ (archive) của ứng dụng, giải nén nó và hi vọng ứng dụng sẽ khởi chạy.

source: **Limited to distributions that have the apps**: the user is limited to the number of distributions that have the needed applications for them to properly setup their workflow. This reduces the amount of distributions that can be suitable for a user.
vi: **Bị giới hạn về các bản phân phối có ứng dụng**: người dùng bị giới hạn ở số lượng bản phân phối có các ứng dụng họ cần cho quy trình làm việc (workflow) của mình. Điều này làm giảm số lượng bản phân phối phù hợp với một người dùng bất kì.

source: **Hard to innovate in OS space**: the maintainers of the distributions have to spend a lot of time packaging applications to make the distribution suitable for the end user, instead of focusing on their end goals. This delays the progress of each distribution.
vi: **Khó đổi mới trong việc phát triển hệ điều hành**: những người duy trì các bản phân phối phải dành nhiều thời gian đóng gói các ứng dụng sao cho bản phân phối ấy phù hợp với người dùng cuối (end user), thay vì tập trung vào mục tiêu của họ. Điều này làm chậm tiến độ phát triển của mỗi bản phân phối.

source: **Old and outdated packages**: LTS distributions often have very old versions of applications packaged natively. Bug reproducibility is hindered by the different environments that applications are run in, and application developers often have little control over how their application is packaged by distributions.
vi: **Gói cũ và lỗi thời**: Các bản phân phối hỗ trợ dài hạn (LTS) thường có các phiên bản ứng dụng rất cũ được đóng gói riêng cho các bản phân phối ấy. Khả năng tái tạo lỗi (bug reproducibility) bị cản trở bởi các môi trường khác nhau ứng dụng chạy trên, và các nhà phát triển ứng dụng thường có ít quyền kiểm soát đối với cách ứng dụng của họ được đóng gói bởi các bản phân phối.

source: Flatpak strives to fix the issues listed above, by conveniently enabling developers to distribute applications from one source and to target the entire Linux desktop.
vi: Flatpak hướng tới khắc phục các vấn đề được liệt kê ở trên bằng cách cho phép các nhà phát triển thuận tiện phân phối ứng dụng từ chỉ một nguồn và nhắm đến hỗ trợ toàn bộ Linux desktop.

source: Reasons to use Flatpak
vi: Các lí do nên sử dụng Flatpak

source: Flatpak has some major advantages over most system package managers:
vi: Flatpak có một số lợi thế lớn so với hầu hết các trình quản lý gói hệ thống:

source: **Universality**: Flatpak allows applications to be installed and run on virtually any Linux distribution. This includes non-GNU distributions, systemd-free distributions, distributions with a read-only operating system (OS), and various architectures without the developer needing the relevant hardware on hand.
vi: **Tính phổ quát**: Flatpak cho phép cài đặt và chạy các ứng dụng trên hầu hết mọi bản phân phối Linux. Điều này bao gồm các bản phân phối không phải GNU, các bản phân phối không có systemd, các bản phân phối có hệ điều hành chỉ đọc (read-only OS), và các kiến trúc chip khác nhau mà nhà phát triển không cần có sẵn phần cứng liên quan.

source: **Space for innovations**: Flatpak facilitates distribution maintainers to focus on their goals to innovate their distribution.
vi: **Tiền đề cho đổi mới**: Flatpak tạo điều kiện cho các nhà bảo trì tập trung vào mục tiêu đổi mới, phát triển bản phân phối của họ.

source: **Stability**: breakage in a Flatpak application will not risk the system from breaking. This is because Flatpak applications and runtimes are contained to not interfere with the system altogether.
vi: **Tính ổn định**: sự cố trong một ứng dụng Flatpak sẽ không làm cả hệ thống bị hỏng. Điều này là do các ứng dụng và Flatpak runtime được contained (khép kín/cô lập) để hoàn toàn không can thiệp vào hệ thống.

source: **Rootless install**: elevated privileges are not required when installing a Flatpak application or a runtime.
vi: **Cài đặt không cần root (quyền truy cập gốc)**: không cần có đặc quyền nâng cao khi cài đặt ứng dụng hoặc Flatpak runtime.

source: **Sandboxed applications**: one of Flatpak's main goals is to increase the security of desktop systems by isolating applications from one another. This is achieved using sandboxing and means that, by default, applications that are run with Flatpak have limited access to the host environment.
vi: **Ứng dụng bị đặt trong hộp cát (sandboxed)**: một trong những mục tiêu chính của Flatpak là tăng cường tính bảo mật của hệ thống bằng việc cách li các ứng dụng với nhau. Điều này được thực thi thông qua kĩ thuật hộp cát và có nghĩa là, theo mặc định, các ứng dụng chạy trên Flatpak có quyền truy cập hạn chế vào môi trường máy chủ.

source: Flatpak has some major advantages over other universal approaches to distributing applications on Linux:
vi: Flatpak có một số lợi thế lớn so với các phương pháp phân phối ứng dụng phổ quát (universal approaches) trên Linux khác:

source: **Decentralized by design**: while Flatpak does provide a centralized service for distributing applications, it also allows decentralized hosting and distribution, so that application developers or downstreams can host their own applications and application repositories.
vi: **Thiết kế phi tập trung**: mặc dù Flatpak cung cấp dịch vụ tập trung để phân phối ứng dụng, nhưng nó cũng cho phép lưu trữ và phân phối phi tập trung, để các nhà phát triển ứng dụng hoặc các downstream (hạ nguồn) có thể lưu trữ ứng dụng và repository của riêng họ.

source: **Desktop integration**: Flatpak also offers native integration for the main Linux desktops, so that users can easily browse, install, run and use Flatpak applications through their existing desktop environment and tools.
vi: **Tích hợp với môi trường desktop**: Flatpak cũng cung cấp tích hợp gốc (native integration) cho các Linux desktop chính để người dùng có thể dễ dàng duyệt, cài đặt, chạy và sử dụng các ứng dụng Flatpak thông qua các công cụ và môi trường desktop hiện có của họ.

source: **Space efficiency**: Flatpak deduplicates libraries and other files used by multiple applications to save megabytes or even gigabytes worth of storage depending on the amount of applications installed.
vi: **Hiệu quả về không gian**: Flatpak loại bỏ sự trùng lặp các thư viện và các tệp được nhiều ứng dụng cùng sử dụng để giảm dung lượng lưu trữ xuống hàng megabyte hoặc thậm chí hàng gigabyte tùy thuộc vào số lượng ứng dụng được cài đặt.

source: **Delta updates**: only changed files are downloaded for updates.
vi: **Các bản cập nhật biến thiên (delta update)**: chỉ những tệp đã thay đổi mới được tải xuống để cập nhật.

source: Other benefits for developers include:
vi: Các lợi ích khác cho nhà phát triển bao gồm:

source: **Forward-compatibility**: the same Flatpak application can be run on different versions of the same distribution, including versions that haven't been released yet. This doesn't require any changes or management by application developers.
vi: **Tính tương thích thuận (forward-compatibility)**: một ứng dụng Flatpak có thể chạy trên các phiên bản khác nhau của cùng một bản phân phối, bao gồm cả các phiên bản chưa được phát hành. Điều này không yêu cầu bất kỳ thay đổi hoặc quản lý nào của nhà phát triển ứng dụng.

source: **Bundling**: this allows application developers to ship almost any dependency or library as part of their application. This gives complete control over which software is used to build applications.
vi: **Đóng gói**: cho phép các nhà phát triển ứng dụng gửi hầu hết mọi dependency (phần phụ thuộc) hoặc thư viện như một phần ứng dụng của họ. Họ có quyền kiểm soát hoàn toàn phần mềm nào được sử dụng để xây dựng ứng dụng.

source: **Consistent application environments**: because these are the same across devices, applications perform as intended. This also makes it easier to identify bugs and to do testing.
vi: **Môi trường ứng dụng nhất quán**: vì các môi trường này giống nhau xuyên suốt các thiết bị nên ứng dụng sẽ hoạt động như mong muốn. Điều này cũng giúp việc xác định lỗi (bugs) và thực hiện kiểm tra (testing) dễ dàng hơn.

source: **Branches**: this allows developers to ship applications from different branches, e.g. ``stable``, ``beta``, etc. while retaining the same name.
vi: **Phân nhánh (branch)**: điều này cho phép nhà phát triển gửi ứng dụng từ các nhánh khác nhau, ví dụ: ``stable``, ``beta``, v.v. trong khi vẫn giữ nguyên tên.

source: **Maintained platforms**: called runtimes, these contain collections of dependencies, which can be used by applications, and which can take a lot of the work out of application development.
vi: **Các nền tảng được duy trì**: được gọi là runtime, chúng chứa các tập hợp dependency mà các ứng dụng có thể sử dụng, và có thể giảm bớt rất nhiều công sức trong quá trình phát triển ứng dụng.

source: In general Flatpak is best suited suited for desktop applications and while command line applications also work, it may not be suited in some cases:
vi: Nói chung, Flatpak phù hợp nhất cho các ứng dụng desktop và mặc dù các ứng dụng dòng lệnh (command-line application) cũng hoạt động nhưng nó có thể không phù hợp trong một số trường hợp:

source: Applications needs to elevate priviledges using ``su, sudo, pkexec`` etc. Flatpak cannot run in SUID binaries inside the sandbox.
vi: Các ứng dụng cần nâng cao đặc quyền bằng cách sử dụng ``su, sudo, pkexec``, v.v. Flatpak không thể chạy ở dạng nhị phân SUID (SUID binary) bên trong hộp cát.

source: Application needs to read ``/proc`` from host or have unfiltered access to processes. This is not allowed as Flatpak has a private proc.
vi: Ứng dụng cần đọc ``/proc`` trên máy chủ hoặc có quyền truy cập không lọc (unfiltered access) vào các tiến trình (process). Điều này không được cho phép vì Flatpak có một tiến trình riêng.

source: Application uses a syscall that is blocklisted by Flatpak's seccomp filter. For example, Flatpak won't allow spawning sub-namespaces in the sandbox.
vi: Ứng dụng sử dụng một syscall (lời gọi hệ thống) nằm trong danh sách chặn của bộ lọc seccomp của Flatpak. Ví dụ: Flatpak sẽ không cho phép tạo ra các sub-namespace (không gian tên phụ) trong hộp cát.

source: Kernel modules or drivers are non application packages and won't work inside a Flatpak.
vi: Các module (mô-đun) hoặc driver (trình điểu khiển) của kernel (nhân hệ điều hành) không phải là các gói ứng dụng và sẽ không hoạt động bên trong Flatpak.

source: In general in cases where the sandbox prohibits the core functionality of the application or makes it too inconvenient and/or obtrusive , it is not best suited to be packaged with Flatpak.
vi: Nói chung, trong các trường hợp hộp cát cấm chức năng cốt lõi của ứng dụng hoặc khiến nó quá bất tiện và/hoặc gây phiền phức thì việc đóng gói bằng Flatpak là không phù hợp.

source: Flatpak also won't export udev rules or systemd services from the sandbox to the host and requires manual configuration after installing the flatpak package.
vi: Flatpak cũng sẽ không xuất các quy tắc udev hoặc các dịch vụ systemd từ hộp cát sang máy chủ, và yêu cầu cấu hình thủ công sau khi cài đặt gói Flatpak.

source: Information about Flatpak's internals can be found in :doc:`under-the-hood`.
vi: Thông tin về các chi tiết bên trong của Flatpak có thể được tìm thấy ở :doc:`under-the-hood`.
