Repository: harrmitch/flatpak-docs
Catalog: po/*/LC_MESSAGES/module-sources.po
Languages: vi

source: Module Sources
vi: Nguồn mô-đun

source: This page will go in depth on each source type with examples.
vi: Trang này sẽ đi sâu vào từng loại nguồn với các ví dụ.

source: Sources are copied or downloaded to the source directory before the build starts. The source directory lives under flatpak-builder's state directory, which by default is located at ``.flatpak-builder`` on host, relative to the manifest root. The source directory for bzr, git and svn sources is at ``.flatpak-builder/git, .flatpak-builder/bzr, .flatpak-builder/svn`` respectively while ``.flatpak-builder/downloads/<checksum>`` is used for file and archive sources.
vi: Nguồn được sao chép hoặc tải xuống thư mục nguồn trước khi bản dựng bắt đầu. Thư mục nguồn nằm trong state directory (thư mục trạng thái) của flatpak-builder, theo mặc định được đặt tại ``.flatpak-builder`` trong thư mục gốc (root) chứa tệp kê khai. Thư mục nguồn cho các nguồn bzr, git và svn lần lượt là ``.flatpak-builder/git, .flatpak-builder/bzr, .flatpak-builder/svn``, trong khi ``.flatpak-builder/downloads/<checksum>`` được sử dụng cho các nguồn là tệp và tệp lưu trữ (file and archive).

source: The ``type`` property of a source determines how that source will be handled before or during build by ``flatpak`` or ``flatpak-builder``.
vi: Thuộc tính ``type`` của một nguồn xác định cách ``flatpak`` hoặc ``flatpak-builder`` sẽ xử lý nguồn đó trước hoặc trong quá trình xây dựng.

source: Most of the sources support ``path`` and ``url`` property where ``path`` is relative to the root of manifest and ``url`` is a direct url to the source.
vi: Hầu hết các nguồn đều có thuộc tính ``path`` và ``url`` trong đó ``path`` là đường dẫn tương đối so với thư mục gốc của tệp kê khai và ``url`` là url trực tiếp đến nguồn.

source: The ``url`` property requires a checksum to be specified after using ``sha256`` or ``sha512``.
vi: Thuộc tính ``url`` yêu cầu chỉ định một checksum (giá trị tổng kiểm) sau khi sử dụng ``sha256`` hoặc ``sha512``.

source: There are a few properties common to all source types ``only-arches``, ``skip-arches`` and ``dest``.
vi: Một vài thuộc tính chung cho tất cả các loại nguồn là ``only-arches``, ``skip-arches`` và `` dest``.

source: ``only-arches`` and ``skip-arches`` are used to build the source only on the specified architecture or skip building it on the specified architecture respectively. This is often useful for binary packages.
vi: ``only-arches`` được sử dụng để chỉ xây dựng nguồn trên kiến trúc được chỉ định và ``skip-arches`` để bỏ qua việc xây dựng trên kiến trúc được chỉ định. Việc này thường hữu ích cho các gói nhị phân (binary packages).

source: Note that ``only-arches`` or ``skip-arches`` are used to control if that particular source is downloaded on the specified architecture(s). If not specified, the default is to download on all architectures.
vi: Lưu ý rằng ``only-arches`` hoặc ``skip-arches`` được sử dụng để kiểm soát xem nguồn cụ thể đó có được tải xuống trên (các) kiến trúc được chỉ định hay không. Nếu không được chỉ định, mặc định là tải xuống trên tất cả các kiến trúc.

source: ``dest`` is used to indicate a directory inside the source directory where the given source will be placed:
vi: ``dest`` được sử dụng để chỉ định một thư mục bên trong thư mục nguồn (source directory) nơi source này (given source) sẽ được đặt:

source: The contents of ``foo.tar.xz`` will be placed under ``.flatpak-builder/build/coolapp/`` and the contents of the ``bar.git`` repo will go under ``.flatpak-builder/build/coolapp/src/deps/bar``.
vi: Nội dung của ``foo.tar.xz`` sẽ được đặt trong ``.flatpak-builder/build/coolapp/`` và nội dung của repo ``bar.git`` sẽ nằm trong ``.flatpak-builder/build/coolapp/src/deps/bar``.

source: This is often useful to replace bundled dependencies inside sources with custom versions.
vi: Nó thường hữu ích cho việc thay thế các dependency đi kèm bên trong các nguồn bằng các phiên bản tùy chỉnh.

source: Archive sources
vi: Nguồn lưu trữ (Archive source)

source: These are sources of ``type: archive``. They are downloaded to the download directory and extracted into the build directory when the build starts.
vi: Đây là những nguồn thuộc ``type: archive``. Chúng được tải xuống thư mục tải xuống (download directory) và được trích xuất vào thư mục xây dựng (build directory) khi quá trình xây dựng bắt đầu.

source: A typical example of using this is:
vi: Một ví dụ điển hình cho việc sử dụng nó là:

source: ``mirror-urls`` is a list of alternative urls that will be used for downloading, if the main ``url`` fails.
vi: ``mirror-urls`` là danh sách các url thay thế sẽ được sử dụng để tải xuống, nếu ``url`` chính không thành công.

source: The ``sha256`` is the sha256 checksum of the downloaded file, supplied by upstream of the source or calculated using ``sha256sum``.
vi: ``sha256`` là sha256 checksum của tệp đã tải xuống, được cung cấp bởi upstream (thượng nguồn) hoặc được tính bằng cách sử dụng ``sha256sum``.

source: ``dest-filename`` is not usually used for this source. It is used to rename the downloaded file. This can be useful if the buildsystem expects a certain name for the archive.
vi: ``dest-filename`` thường không được sử dụng cho nguồn này. Nó được sử dụng để đổi tên tệp đã tải xuống. Nó có thể hữu ích nếu hệ thống xây dựng (buildsystem) mong đợi một tên nhất định cho tệp lưu trữ.

source: ``strip-components`` is the number of pathname components to strip during extraction. This defaults to ``1`` if not specified.
vi: ``strip-components`` là số lượng các thành phần trong tên đường dẫn để strip trong quá trình trích xuất (extract). Mặc định là ``1`` nếu không được chỉ định.

source: ``flatpak-builder`` supports the following archive types: ``"rpm", "tar", "tar-gzip", "tar-compress", "tar-bzip2", "tar-lzip", "tar-lzma", "tar-lzop", "tar-xz", "tar-zst", "zip", "7z"`` The archive type is guessed from the suffix of the file basename.
vi: ``flatpak-builder`` hỗ trợ các loại tệp lưu trữ sau: ``"rpm", "tar", "tar-gzip", "tar-compress", "tar-bzip2", "tar-lzip", "tar-lzma", "tar-lzop", "tar-xz", "tar-zst", "zip", "7z"``. Loại tệp lưu trữ được đoán từ hậu tố của tên cơ sở tệp (file basename).

source: ``rpm`` is extracted with ``rpm2cpio``, ``zip`` is extracted with ``unzip`` and ``7z`` is extratced with ``7z``. The rest are extracted with ``tar``. These should be present on host so that flatpak-builder can use them.The archive type is calculated from the suffix of the file basename.
vi: ``rpm`` được trích xuất bằng ``rpm2cpio``, ``zip`` được trích xuất bằng ``unzip`` và ``7z`` được trích xuất bằng ``7z``. Các loại còn lại được trích xuất bằng ``tar``. Chúng có mặt trên máy chủ để flatpak-builder có thể sử dụng. Loại lưu trữ được tính toán từ hậu tố của tên cơ sở tệp.

source: In case the correct archive type cannot be `guessed` from the filename ``archive-type: str`` can be used to manually specify the type where ``str`` is one of the above types.
vi: Trong trường hợp không thể `đoán` đúng loại tệp lưu trữ từ tên tệp, ``archive-type: str`` có thể được sử dụng để chỉ định thủ công loại tệp, trong đó ``str`` là một trong các loại trên.

source: Git sources
vi: Nguồn Git

source: These are sources of ``type: git`` and it requires ``git`` to be available on the host. A typical example of using this is:
vi: Đây là những nguồn thuộc ``type: git`` và nó yêu cầu ``git`` có sẵn trên máy chủ. Ví dụ điển hình của việc sử dụng nó là:

source: ``url`` is url of the git repository. The following schemes are usually used ``http://``, ``https://``, ``git://``, ``git+ssh://``, ``ssh://``.
vi: ``url`` là url của kho lưu trữ git. Các scheme (phần mở đầu của url) sau đây thường được sử dụng ``http://``, ``https://``, ``git://``, ``git+ssh://``, ``ssh://``.

source: To use the ``file://`` scheme for a git repository, do ``git config --global protocol.file.allow always``.
vi: Để sử dụng scheme ``file://`` cho kho lưu trữ git, dùng ``git config --global protocol.file.allow always``.

source: A ``branch: branch_name`` can also be used in place of a ``tag`` and ``commit``.
vi: ``branch: branch_name`` cũng có thể được sử dụng thay cho ``tag`` và ``commit``.

source: ``commit`` is the commit to use from the git repository.
vi: ``commit`` là commit để dụng từ git repository.

source: In case of a tag, this must be the commit, the tag points to (``git rev-list -n 1 $tag``). In case of a ``branch``, it is verified that the branch points to this specific commit (``git show-ref "refs/heads/$branch"``).
vi: Trong trường hợp dùng tag, đây phải là một commit, tag trỏ đến (``git rev-list -n 1 $tag``). Trong trường hợp dùng ``branch``, phải xác minh rằng branch trỏ đến commit cụ thể (``git show-ref "refs/heads/$branch"``).

source: To ensure reproduciblity and avoid build failures, it is best to avoid using ``branch`` and always add a ``commit`` to a ``tag``.
vi: Để đảm bảo khả năng tái tạo (reproducibility) và tránh lỗi xây dựng, tốt nhất là tránh sử dụng ``branch`` và luôn thêm ``commit`` vào ``tag``.

source: By default ``flatpak-builder`` will do a shallow-clone of the git repository and checkout submodules if any. ``disable-shallow-clone: true`` and ``disable-submodules`` can be used to override this behaviour.
vi: Theo mặc định, ``flatpak-builder`` sẽ làm một bản sao nông (shallow-clone) của kho lưu trữ git và các checkout submodules nếu có. ``disable-shallow-clone: true`` và ``disable-submodules`` có thể được sử dụng để ghi đè hành vi này.

source: ``git`` source also supports using a local git repository with the ``path`` property.
vi: Nguồn ``git`` cũng hỗ trợ sử dụng kho lưu trữ git cục bộ với thuộc tính ``path``.

source: Currently ``flatpak-builder`` does not support ``git lfs``. It can be worked around with using ``buildsystem: simple`` and running ``git lfs pull`` in the ``build-commands``.
vi: Hiện tại ``flatpak-builder`` không hỗ trợ ``git lfs``. Giải pháp là sử dụng ``buildsystem: simple`` và chạy ``git lfs pull`` trong ``build-commands``.

source: File sources
vi: Nguồn tập tin (File sources)

source: These are sources of ``type: file``. They are copied into the source directory without any modifications.
vi: Đây là những nguồn thuộc ``type: file``. Chúng được sao chép vào thư mục nguồn không có kèm bất kì sửa đổi nào.

source: Any arbitrary file type can be specified here along with ``buildsystem: simple`` to manually modify, build or install it within ``build-commands``. This can be used in place of ``type: archive`` to manually extract an archive, uncompress squashfs filesystems (like snaps) etc. provided the tool being used is made available inside the sandbox.
vi: Bất kỳ loại tệp tùy ý nào cũng có thể được chỉ định ở đây, và với ``buildsystem: simple`` có thể sửa đổi, xây dựng hoặc thủ công cài đặt nó trong ``build-commands``. Nó có thể được sử dụng thay cho ``type: archive`` để trích xuất thủ công một tệp lưu trữ, giải nén các hệ thống tệp squashfs (như snaps), v.v. miễn là công cụ đang sử dụng được cung cấp bên trong hộp cát.

source: A typical example is:
vi: Một ví dụ điển hình là:

source: ``dest-filename`` is typically used with this source type to make the filename `predictable` for the commands in the ``build-commands`` array.
vi: ``dest-filename`` thường được sử dụng với loại nguồn này để làm cho tên tệp `dễ đoán` cho các lệnh có trong ``build-commands``.

source: Patch sources
vi: Nguồn vá (Patch sources)

source: These are sources of ``type: patch`` used with patchfiles. This requires ``patch`` and optionally ``git`` to be available on host. The typical usage is to create patchfiles and place them somewhere relative to the manifest root. The ``path`` property is the location of the file relative to the manifest.
vi: Đây là những nguồn thuộc ``type: patch`` được sử dụng với patchfiles (các tệp vá). Nó yêu cầu ``patch`` và có thể cần ``git`` có sẵn trên máy chủ. Cách sử dụng điển hình là tạo các patchfile và đặt chúng ở đâu đó tương đối so với thư mục chứa tệp kê khai. Thuộc tính ``path`` là vị trí của tệp đó xét tương đối so với tệp kê khai.

source: Multiple patches can be specified with ``paths``:
vi: Nếu nhiều hơn, các bản vá có thể được chỉ định với ``paths``:

source: By default, ``patch -p 1`` is used, but it can be adjusted with ``strip-components`` and additional options can be passed with ``options``. The defaults here work well with the default patchfiles generated with ``git format-patch`` or ``git diff``.
vi: Theo mặc định, ``patch -p 1`` được sử dụng, nhưng có thể được điều chỉnh với ``strip-components`` và có thể đưa vào các tùy chọn bổ sung với ``options``. Các mặc định (defaults) ở đây hoạt động tốt với các patchfile được mặc định tạo bằng ``git format-patch`` hoặc ``git diff``.

source: ``use-git: true`` and ``use-git-am: true`` can be used to use ``git apply``and ``git am`` respectively instead of ``patch``.
vi: ``use-git: true`` và ``use-git-am: true`` có thể được sử dụng để dùng ``git apply`` và `git am`` tương ứng thay vì ``patch``.

source: Shell and Script sources
vi: Nguồn Shell và Script

source: A shell source with ``type: shell`` is used to modify a source during extraction. ``commands`` takes in any shell commands.
vi: Một nguồn shell với ``type: shell`` được sử dụng để sửa đổi một nguồn trong quá trình trích xuất. ``commands`` nhận bất kỳ các lệnh shell nào.

source: This is usually used to make quick modifications to sources but a patch should be used for any complex modification to make it fail safe.
vi: Nó thường được sử dụng để sửa đổi nhanh chóng các nguồn nhưng một bản vá nên được sử dụng cho bất kỳ sửa đổi phức tạp nào để đảm bảo an toàn (fail-safe).

source: A script source with ``type: script`` is used to create self-contained ``/bin/sh`` scripts. ``commands`` takes in any shell commands and ``dest-filename`` can be used to specify the name for the resultant file inside the source directory.
vi: Nguồn script với ``type: script`` được sử dụng để tạo các script ``/bin/sh`` khép kín. ``commands`` nhận bất kỳ các lệnh shell nào và ``dest-filename`` có thể được sử dụng để chỉ định tên cho tệp sẽ được tạo bên trong thư mục nguồn.

source: This is often useful if the executable requires custom arguments to be passed before launch.
vi: Nó thường hữu ích nếu executable (tệp thực thi) yêu cầu các đối số tùy chỉnh (custom arguments) được đưa vào khi khởi chạy.

source: Extra Data
vi: Dữ liệu bổ sung (Extra data)

source: Extra data is often used for proprietary applications to avoid redistribution by downloading the binary package provided by the original distributors during installation by the user. It may also be used for sources with very large file sizes (over several gigabytes) to avoid storing a huge amount of data in the ostree repository.
vi: Extra data thường được sử dụng cho các ứng dụng độc quyền để tránh phân phối lại bằng cách tải xuống binary package được cung cấp bởi các nhà phân phối ban đầu trong quá trình người dùng cài đặt. Nó cũng có thể được sử dụng cho các nguồn có kích thước tệp rất lớn (trên vài gigabyte) để tránh lưu trữ một lượng lớn dữ liệu trong kho lưu trữ ostree.

source: Since the package is downloaded only when installing, the application metadata such as the desktop file, icon and the MetaInfo file must be installed beforehand so that appstream can compose them to generate catalogue data.
vi: Vì gói chỉ được tải xuống khi cài đặt, siêu dữ liệu của ứng dụng như tệp desktop, biểu tượng và tệp MetaInfo phải được cài đặt trước để appstream có thể soạn chúng để tạo dữ liệu danh mục (catalogue data).

source: When installing the Flatpak package containing an extra data source, Flatpak calls the ``apply_extra`` script which executes the command defined in it. The dependencies needed to run the commands in the script must be available in the sandbox.
vi: Khi cài đặt gói Flatpak chứa nguồn dữ liệu bổ sung, Flatpak gọi script ``apply_extra``, nó thực thi lệnh được xác định trong nó. Các dependency cần thiết để chạy các lệnh trong script phải có sẵn trong hộp cát.

source: The following properties must be present for an `extra-data` source:
vi: Các thuộc tính sau đây phải có mặt cho nguồn `extra-data`:

source: ``type: extra-data`` indicates that this is an extra-data source. Multiple such sources can exist.
vi: ``type: extra-data`` cho biết rằng đây là nguồn dữ liệu bổ sung. Nhiều nguồn như vậy có thể tồn tại.

source: ``url`` should be a direct link to the binary source package. This is downloaded by Flatpak when installing the Flatpak package.
vi: ``url`` phải là một liên kết trực tiếp đến gói nguồn nhị phân. Nó được tải xuống bởi Flatpak khi cài đặt gói Flatpak.

source: ``sha256`` should be its SHA-256 checksum of the above package.
vi: ``sha256`` phải là checksum SHA-256 của gói trên.

source: ``size`` should be the file size of the package in `bytes` (``wc --bytes < file``).
vi: ``size`` phải là kích thước của gói tính bằng `byte` (``wc --byte < file``).

source: ``filename`` can be anything to name the downloaded source package.
vi: ``filename`` có thể là bất cứ thứ gì để đặt tên cho gói nguồn đã tải xuống.

source: The binary source packages are often specific to one architecture, so ``only-arches`` can be used to make the build specific to that architecture only.
vi: Các gói nguồn nhị phân thường dành riêng cho một kiến trúc, vì vậy ``only-arches`` có thể được sử dụng giới hạn bản dựng chỉ dành riêng cho kiến trúc đó.

source: A typical extra-data manifest may look like:
vi: Tệp kê khai có extra-data điển hình có thể giống như:

source: The ``buildsystem`` is ``simple`` as the module is manually installed.
vi: ``buildsystem`` là ``simple`` vì mô-đun được cài đặt thủ công.

source: The ``apply_extra`` script here requires ``unsquashfs`` to run, so that is built and installed.
vi: Script ``apply_extra`` ở đây yêu cầu ``unsquashfs`` để chạy, vì vậy nó được xây dựng và cài đặt.

source: Flatpak supports exporting icons, desktop files etc. from ``/app/extra/export/share/`` however when creating a Flatpak package for a software store like Flathub or when composing the metadata with appstreamcli, desktop files and icons must not be placed in ``/app/extra/export/`` and instead should go to the proper locations documented in :doc:`conventions`.
vi: Flatpak hỗ trợ xuất các biểu tượng, tệp desktop, v.v. từ ``/app/extra/export/share/`` tuy nhiên khi tạo gói Flatpak cho cửa hàng phần mềm như Flathub hoặc khi soạn metadata bằng appstreamcli, các tệp desktop và biểu tượng không được đặt trong ``/app/extra/export/`` và thay vào đó phải đi đến các vị trí thích hợp được ghi lại trong :doc:`conventions`.

source: The icon, desktop file and Metainfo must be added as sources. The ``path`` indicates that they reside in the same directory relative to the manifest. The first three lines of the ``build-commands`` installs them so that ``appstream-compose`` can compose the metadata.
vi: Biểu tượng, tệp desktop và Metainfo phải được thêm làm nguồn. ``path`` chỉ định rằng chúng nằm trong cùng một thư mục vị trí tương đối so với tệp kê khai. Ba dòng đầu tiên của ``build-commands`` cài đặt chúng để ``appstream-compose`` có thể soạn metadata.

source: The last line creates an empty symlink from ``${FLATPAK_DEST}/extra/`` to ``${FLATPAK_DEST}/bin/`` so that the executable is found in ``$PATH`` inside the sandbox and can be used in the top-level ``command: foo_binary`` property. Instead of a symlink this also often a script like:
vi: Dòng cuối cùng tạo ra một liên kết tượng trưng (symlink) trống từ ``${FLATPAK_DEST}/extra/`` đến ``${FLATPAK_DEST}/bin/`` để tệp thực thi được tìm thấy trong ``$PATH`` bên trong hộp cát và có thể được sử dụng trong thuộc tính cấp cao nhất (top-level property) ``command: foo_binary``. Thay vì một liên kết tượng trưng, đây cũng thường là một script như:

source: The ``subdir`` directory comes from the contents of the extracted snap and how that is installed.
vi: Thư mục ``subdir`` xuất phát từ nội dung của snap được trích xuất và cách cài đặt.

source: The commands needed to extract the snap are specified in the ``apply_extra`` script. These can be any shell commands that run when installing the Flatpak package but note that it won't have access to anything outside ``/app/extra``. The script is run in a sandbox (equivalent to ``flatpak run --sandbox``) and won't have network, dbus or any host access. The ``apply_extra`` can itself be a seperate script file too but must be installed as ``${FLATPAK_DEST}/bin/apply_extra``.
vi: Các lệnh cần thiết để trích xuất snap được chỉ định trong script ``apply_extra``. Chúng có thể là bất kỳ lệnh shell nào chạy khi cài đặt gói Flatpak nhưng lưu ý rằng nó sẽ không có quyền truy cập vào bất kỳ thứ gì bên ngoài ``/app/extra``. Script được chạy trong một sandbox (tương đương với "flatpak run --sandbox") và sẽ không có mạng, dbus hoặc bất kỳ quyền truy cập máy chủ nào. Bản thân ``apply_extra`` cũng có thể là một tệp script riêng biệt nhưng phải được cài đặt là ``${FLATPAK_DEST}/bin/apply_extra``.

source: ``unsquashfs -quiet -no-progress foo.snap`` extracts the snap package into a directory called ``squashfs-root``, then the contents of that direcory are moved to ``/app/extra`` and lastly ``squashfs-root`` and the snap package itself is cleaned up to save space.
vi: ``unsquashfs -quiet -no-progress foo.snap`` trích xuất gói snap vào một thư mục có tên là ``squashfs-root``, sau đó nội dung của thư much đó được chuyển đến ``/app/extra`` và cuối cùng ``squashfs-root`` và chính gói snap được dọn dẹp để tiết kiệm dung lượng.

source: This is another example that can be used to extract Debian packages (``.deb``).
vi: Đây là một ví dụ khác có thể được sử dụng để giải nén các gói Debian (``.deb``).

source: Flatpak extensions can also use extra-data sources in a similar manner. This is an example of an extension manifest utilising an extra-data source.
vi: Các phần mở rộng Flatpak cũng có thể sử dụng các nguồn dữ liệu bổ sung theo cách tương tự. Đây là ví dụ về tệp kê khai phần mở rộng sử dụng nguồn extra-data.

source: For more information on Flatpak extensions please see :doc:`extension`.
vi: Để biết thêm thông tin về các phần mở rộng Flatpak, vui lòng xem :doc:`extension`.

source: Directory source
vi: Nguồn thư mục (Directory source)

source: A directory source with ``type: dir`` is best suited for use in CI to build the latest changes and avoid downloading multiple times. These don't support any caching, so it will be rebuilt each time the application is being built.
vi: Nguồn thư mục với ``type: dir`` phù hợp nhất để sử dụng trong CI (tích hợp liên tục) để xây dựng các thay đổi mới nhất và tránh tải xuống nhiều lần. Chúng không hỗ trợ bất kỳ bộ nhớ đệm nào, vì vậy nó sẽ được xây dựng lại mỗi khi ứng dụng được xây dựng.

source: When submitting an application to software stores like Flathub, ``dir`` should be avoided altogether.
vi: Khi gửi đơn đăng ký đến các cửa hàng phần mềm như Flathub, nên tránh hoàn toàn ``dir``.

source: ``path`` should be the path of the local directory relative to the manifest root path, whoose contents will be copied during build.
vi: ``path`` phải là đường dẫn của thư mục cục bộ xét tương đối so với đường dẫn gốc của tệp kê khai, nội dung trong đường dẫn sẽ được sao chép trong quá trình xây dựng.

source: Additonally there are `bzr`, `svn` and `inline` sources supported. `bzr` and `svn` requires the `bzr <https://code.launchpad.net/bzr>`_ and `svn <https://subversion.apache.org/>`_ commandline tools to be installed respectively. Please see :doc:`flatpak-builder-command-reference` for them.
vi: Bên cạnh đó, các nguồn `bzr`, `svn` và `inline` được hỗ trợ. `bzr` và `svn` yêu cầu các công cụ dòng lệnh tương ứng `bzr <https://code.launchpad.net/bzr>`_ và `svn <https://subversion.apache.org/>`_ phải được cài đặt. Vui lòng xem :doc:`flatpak-builder-command-reference`.
