Repository: harrmitch/flatpak-docs
Catalog: po/*/LC_MESSAGES/python.po
Languages: vi

source: Python applications that use supported build systems like Meson, CMake, or Autotools can be built using the standard method. However, many Python applications use custom install scripts or are expected to be installed through Setuptools and ``pip``.
vi: Các ứng dụng Python sử dụng các hệ thống xây dựng (build system) được hỗ trợ như Meson, CMake hoặc Autotools có thể được xây dựng bằng phương pháp tiêu chuẩn. Tuy nhiên, nhiều ứng dụng Python sử dụng các script cài đặt tùy chỉnh hoặc mong muốn được cài đặt thông qua Setuptools và ``pip``.

source: For these cases, ``flatpak-builder`` provides the ``simple`` buildsystem. Rather than automating the build process, ``simple`` accepts a ``build-commands`` array of strings, which are executed in sequence.
vi: Đối với những trường hợp này, ``flatpak-builder`` cung cấp hệ thống xây dựng ``simple``. Thay vì tự động hóa quá trình xây dựng, ``simple`` chấp nhận một chuỗi ``build-commands`` để được thực thi theo trình tự.

source: For example, the following YAML makes building the popular requests module rather straightforward:
vi: Ví dụ: YAML sau đây làm cho việc xây dựng mô-đun requests phổ biến khá đơn giản:

source: Here, ``build-commands`` is an array containing the commands required to build and install the module. As can be seen, in this case ``pip`` is run to do this. Here, the ``--prefix=/app`` option is important, because otherwise ``pip`` would try to install the module under ``/usr/`` which, because ``/usr/`` is mounted read-only inside the sandbox, would fail.
vi: Ở đây, ``build-commands`` là một danh sách chứa các lệnh cần thiết để xây dựng và cài đặt mô-đun. Có thể thấy, trong trường hợp này ``pip`` được chạy để làm điều đó. Ở đây, tùy chọn ``--prefix=/app`` rất quan trọng, bởi vì nếu không ``pip`` sẽ cố gắng cài đặt mô-đun trong ``/usr/``, và vì ``/usr/`` là chỉ đọc (read-only) bên trong hộp cát nên sẽ không thành công.

source: Note that ``--no-deps`` is only used for the purpose of the example - since the requests module has its own dependencies, the build would fail. If multiple dependencies are required, it is better to install them using the method in the next section, instead.
vi: Lưu ý rằng ``--no-deps`` chỉ được sử dụng cho mục đích của ví dụ - vì mô-đun yêu cầu có các dependency riêng, bản dựng sẽ thất bại. Nếu cần nhiều dependency, sẽ tốt hơn là cài đặt chúng bằng phương thức trong phần tiếp theo.

source: Building multiple Python dependencies
vi: Xây dựng nhiều Python dependencies

source: Even though the example above installs, it won't actually work. This is because the requests module has a number of dependencies that haven't been installed:
vi: Mặc dù ví dụ trên có thể cài đặt, nó sẽ không thực sự hoạt động. Điều này là do mô-đun requests có một số dependency chưa được cài đặt:

source: Four dependencies aren't very many, and could be installed using the ``simple`` method described above. However, anything more complex than this would quickly become tedious.
vi: Bốn dependency không phải là quá nhiều và có thể được cài đặt bằng phương pháp ``simple`` được mô tả ở trên. Tuy nhiên, bất cứ thứ gì phức tạp hơn thế này sẽ nhanh chóng trở nên mệt nhọc.

source: For these cases, `flatpak-pip-generator <https://github.com/flatpak/flatpak-builder-tools/tree/master/pip>`_ can be used to generate the necessary manifest JSON. This is a Python script that takes a package name and uses ``pip`` to identify its dependencies, along with their tarball URLs and hashes.
vi: Đối với những trường hợp này, `flatpak-pip-generator <https://github.com/flatpak/flatpak-builder-tools/tree/master/pip>`_ có thể được sử dụng để tạo phần kê khai dạng JSON (manifest JSON) cần thiết. Đây là một Python script nhận vào tên của gói, và sử dụng ``pip`` để xác định các dependency cùng với các tarball URL và hash của nó.

source: Using ``flatpak-pip-generator`` is as simple as running::
vi: Sử dụng ``flatpak-pip-generator`` chỉ đơn giản như là::

source: Or if you have a ``requirements.txt`` file you can generate modules for every listed package::
vi: Hoặc nếu bạn có tệp ``requirements.txt``, bạn có thể tạo mô-đun cho mọi gói được liệt kê::

source: This will output a file called ``python3-requests.json``, containing the necessary manifest JSON, which can then be included in your application's manifest file. Even if your manifest uses YAML, you can still include JSON like this::
vi: Nó sẽ xuất ra một tệp có tên là ``python3-requests.json``, chứa phần kê khai dạng JSON cần thiết, sau đó có thể đưa nó vào tệp kê khai của ứng dụng của bạn. Ngay cả khi tệp kê khai của bạn sử dụng YAML, bạn vẫn có thể bao gồm JSON như sau::
