Repository: harrmitch/flatpak-docs
Catalog: po/*/LC_MESSAGES/sandbox-permissions.po
Languages: vi

source: Sandbox Permissions
vi: Quyền hộp cát (Sandbox Permissions)

source: One of Flatpak's main goals is to increase the security of desktop systems by isolating applications from one another. This is achieved using sandboxing and means that, by default, applications that are run with Flatpak have extremely limited access to the host environment. This includes:
vi: Một trong những mục tiêu chính của Flatpak là tăng cường bảo mật cho các hệ thống desktop bằng cách cô lập các ứng dụng với nhau. Việc này được thực hiện bằng cách sử dụng hộp cát và có nghĩa là, theo mặc định, các ứng dụng được chạy với Flatpak có quyền truy cập cực kỳ hạn chế vào môi trường máy chủ. Nó bao gồm:

source: No access to any host files except the runtime, the app, ``~/.var/app/$FLATPAK_ID``, and ``$XDG_RUNTIME_DIR/app/$FLATPAK_ID``. Only the latter two being writable.
vi: Không có quyền truy cập vào bất kỳ tệp máy chủ nào ngoại trừ runtime, chính ứng dụng, ``~/.var/app/$FLATPAK_ID`` và ``$XDG_RUNTIME_DIR/app/$FLATPAK_ID``. Chỉ có quyền viết cho hai cái thư mục cuối cùng (writable).

source: No access to the network.
vi: Không có quyền truy cập vào mạng.

source: No access to any device nodes (apart from ``/dev/null``, etc).
vi: Không có quyền truy cập vào bất kỳ tập tin thiết bị (device node) nào (ngoài ``/dev/null``, v.v.).

source: No access to processes outside the sandbox.
vi: Không có quyền truy cập vào các tiến trình (process) bên ngoài hộp cát.

source: Limited syscalls. For instance, apps can't use nonstandard network socket types or ptrace other processes.
vi: Các lời gọi hệ thống (syscall) hạn chế. Ví dụ: các ứng dụng không thể sử dụng các loại cổng cắm mạng (network socket) không chuẩn hoặc thực hiện ptrace với các tiến trình khác.

source: Limited access to the session D-Bus instance - an app can only own its own name on the bus.
vi: Truy cập hạn chế vào session D-Bus instance (đối tượng D-Bus phiên) - một ứng dụng chỉ có thể sở hữu tên của chính nó trên bus.

source: No access to host services like X11, system D-Bus, or PulseAudio.
vi: Không có quyền truy cập vào các dịch vụ máy chủ như X11, hệ thống D-Bus, hoặc PulseAudio.

source: Most applications will need access to some of these resources in order to be useful. This is primarily done during the finishing build stage, which can be configured through the ``finish-args`` section of the manifest file (see :doc:`manifests`).
vi: Hầu hết các ứng dụng sẽ cần truy cập vào một số tài nguyên này để có thể dùng được. Việc này chủ yếu được thực hiện trong giai đoạn hoàn thiện xây dựng (finishing build stage), có thể được cấu hình thông qua phần ``finish-args`` của tệp kê khai (xem :doc:`manifests`).

source: Portals
vi: Portals (Cổng)

source: Portals have already been mentioned in :doc:`basic-concepts`. They are a framework for providing access to resources outside of the sandbox, including:
vi: Portal đã được đề cập trong :doc:`basic-concepts`. Chúng là một framework cung cấp quyền truy cập vào các tài nguyên bên ngoài hộp cát, bao gồm:

source: Opening files with a native file chooser dialog
vi: Mở tệp bằng hộp thoại chọn tệp gốc (native file chooser dialog)

source: Opening URIs
vi: Mở URI

source: Printing
vi: In ấn

source: Showing notifications
vi: Hiển thị thông báo

source: Taking screenshots
vi: Chụp ảnh màn hình

source: Inhibiting the user session from ending, suspending, idling or getting switched away
vi: Ngăn user session khỏi ending (kết thúc), suspending (tạm dừng), idling (chạy không) hoặc switched away (bị chuyển đi)

source: Getting network status information
vi: Lấy thông tin trạng thái mạng

source: In many cases, portals use a system component to implicitly ask the user for permission before granting access to a particular resource. For example, in the case of opening a file, the user's selection of a file using the file chooser dialog is interpreted as implicitly granting the application access to whatever file is chosen.
vi: Trong nhiều trường hợp, portals sử dụng một thành phần hệ thống để ngầm yêu cầu người dùng cho phép trước khi cấp quyền truy cập vào một tài nguyên cụ thể. Ví dụ: trong trường hợp mở tệp, việc người dùng lựa chọn tệp bằng hộp thoại chọn tệp được hiểu là ngầm cấp cho ứng dụng quyền truy cập vào bất kỳ tệp nào được chọn.

source: This approach enables applications to avoid having to configure blanket access to large amounts of data or services and gives users control over what their applications have access to.
vi: Hướng đi này cho phép các ứng dụng tránh phải cấu hình quyền truy cập chung (blanket access) vào một lượng lớn dữ liệu hoặc dịch vụ, và cho phép người dùng kiểm soát những gì ứng dụng của họ có quyền truy cập.

source: Interface toolkits like GTK3 and Qt5 implement transparent support for portals, meaning that applications don't need to do any additional work to use them (it is worth checking which portals each toolkit supports). Applications that aren't using a toolkit with support for portals can refer to the `xdg-desktop-portal API documentation <https://flatpak.github.io/xdg-desktop-portal/>`_ for information on how to use them.
vi: Các bộ công cụ giao diện như GTK3 và Qt5 thực hiện hỗ trợ minh bạch cho các portal, có nghĩa là các ứng dụng không cần phải thực hiện bất kỳ công việc bổ sung nào để sử dụng chúng (nên kiểm tra mỗi toolkit hỗ trợ các portal nào). Các ứng dụng không sử dụng toolkit có hỗ trợ cho portals có thể tham khảo `tài liệu API xdg-desktop-portal <https://flatpak.github.io/xdg-desktop-portal/>`_ để biết thông tin về cách sử dụng chúng.

source: Permissions guidelines
vi: Nguyên tắc đề xuất về quyền (Permissions guidelines)

source: While application developers have control over the sandbox permissions they wish to configure, good practice is encouraged and can be enforced. For example, the Flathub hosting service places requirements on which permissions can be used, and software on the host may warn users if certain permissions are used.
vi: Mặc dù các nhà phát triển ứng dụng có thể kiểm soát các quyền sandbox mà họ muốn cấu hình, khuyến khích thực thi một số thói quen tốt về việc đặt quyền. Ví dụ: dịch vụ lưu trữ Flathub đặt ra các yêu cầu về những quyền có thể được sử dụng và phần mềm trên máy chủ có thể cảnh báo người dùng nếu một số quyền nhất định được sử dụng.

source: The following guidelines describe which permissions can be freely used, which can be used on an as-needed basis, and which should be avoided.
vi: Các hướng dẫn sau đây mô tả các quyền nào có thể được sử dụng tự do, quyền nào chỉ nên sử dụng khi cần thiết và quyền nào nên tránh.

source: Standard permissions
vi: Các quyền tiêu chuẩn

source: The following permissions provide access to basic resources that applications commonly require, and can therefore be freely used:
vi: Các quyền sau đây cung cấp quyền truy cập vào các tài nguyên cơ bản mà các ứng dụng thường yêu cầu và do đó có thể được sử dụng tự do:

source: ``--allow=bluetooth`` - Allow access to Bluetooth
vi: ``--allow=bluetooth`` - Cho phép truy cập vào Bluetooth

source: ``--device=dri`` - OpenGL rendering
vi: ``--device=dri`` - OpenGL rendering (kết xuất OpenGL)

source: ``--device=input`` - Access to ``/dev/input``
vi: ``--device=input`` - Truy cập vào ``/dev/input``

source: ``--share=ipc`` - share IPC namespace with the host [#f1]_
vi: ``--share=ipc`` - chia sẻ không gian tên IPC (IPC namespace) với máy chủ [#f1]_

source: ``--share=network`` - access the network [#f2]_
vi: ``--share=network`` - truy cập mạng [#f2]_

source: ``--socket=cups`` - Talk to the CUPS printing system
vi: ``--socket=cups`` - Nói chuyện với hệ thống in CUPS

source: ``--socket=gpg-agent`` - Talk to the GPG agent
vi: ``--socket=gpg-agent`` - Nói chuyện với GPG agent

source: ``--socket=pcsc`` - Smart card access
vi: ``--socket=pcsc`` - Truy cập thẻ thông minh (smart card)

source: ``--socket=pulseaudio`` - Play sound with PulseAudio
vi: ``--socket=pulseaudio`` - Phát âm thanh bằng PulseAudio

source: ``--socket=ssh-auth``- Allow access to ``SSH_AUTH_SOCK``
vi: ``--socket=ssh-auth``- Cho phép truy cập vào ``SSH_AUTH_SOCK``

source: ``--socket=wayland`` - Show windows with Wayland
vi: ``--socket=wayland`` - Hiển thị cửa sổ với Wayland

source: ``--socket=x11`` - show windows using X11
vi: ``--socket=x11`` - hiển thị cửa sổ bằng X11

source: ``--socket=fallback-x11`` - show windows using X11, if Wayland is not available, overrides ``x11`` socket permission. Note that you must still use ``--socket=wayland`` for wayland permission
vi: ``--socket=fallback-x11`` - hiển thị các cửa sổ bằng X11 nếu Wayland không khả dụng, sẽ ghi đè quyền socket ``x11``. Lưu ý rằng bạn vẫn phải sử dụng ``--socket=wayland`` để cho phép wayland

source: Applications that do not support native Wayland should use ``--socket=x11`` and applications that do should use ``--socket=fallback-x11`` and ``--socket=wayland``. The two configurations here will make it work on both X11 and Wayland sessions of the desktop environment.
vi: Các ứng dụng không hỗ trợ gốc cho Wayland nên sử dụng ``--socket=x11`` và các ứng dụng có hỗ trợ nên sử dụng ``--socket=fallback-x11`` và ``--socket=wayland``. Hai cấu hình này sẽ làm cho nó hoạt động trên cả phiên X11 và Wayland của môi trường desktop.

source: D-Bus access
vi: Truy cập D-Bus

source: Access to the entire bus with ``--socket=system-bus`` or ``--socket=session-bus`` is a security risk and must be avoided, unless the application is a development tool.
vi: Truy cập vào toàn bộ bus với ``--socket=system-bus`` hoặc ``--socket=session-bus`` là một rủi ro bảo mật và phải tránh, trừ khi ứng dụng là một công cụ phát triển.

source: ``flatpak run --log-session-bus <appid>`` can be used to find the specific D-Bus permissions needed.
vi: ``flatpak run --log-session-bus <appid>`` có thể được sử dụng để tìm các quyền D-Bus cụ thể cần thiết.

source: **Ownership**
vi: **Quyền sở hữu**

source: Applications are automatically granted access to their own namespace. Ownership beyond this is typically unnecessary, although there are a small number of exceptions, such as using `MPRIS to provide media controls <https://www.freedesktop.org/wiki/Specifications/mpris-spec/>`_.
vi: Các ứng dụng được tự động cấp quyền truy cập vào không gian tên của chính chúng. Quyền sở hữu ngoài phạm vi này thường không cần thiết, mặc dù có một số ít trường hợp ngoại lệ, chẳng hạn như sử dụng `MPRIS để cung cấp kiểm soát phương tiện <https://www.freedesktop.org/wiki/Specifications/mpris-spec/>`_.

source: **Talk**
vi: **Quyền nói chuyện**

source: Talk permissions can be freely used, although it is recommended to use the minimum required.
vi: Quyền nói chuyện có thể được sử dụng tự do, mặc dù bạn nên sử dụng mức tối thiểu cần thiết.

source: Filesystem access
vi: Truy cập hệ thống tệp

source: As a general rule, static and permanent filesystem access should be limited as much as possible. This includes:
vi: Theo nguyên tắc chung, quyền truy cập tĩnh (static) và vĩnh viễn (permanent) vào hệ thống tệp nên được hạn chế tối đa. Thực hiện việc này thông qua:

source: Using portals as an alternative to blanket filesystem access, wherever possible.
vi: Sử dụng portals thay thế cho quyền truy cập hệ thống tệp chung (blanket access) bất cứ khi nào có thể.

source: Using read-only access wherever possible, using the ``:ro`` option.
vi: Sử dụng quyền truy cập chỉ đọc bất cứ khi nào có thể, sử dụng tùy chọn ``: ro``.

source: If some home directory access is absolutely required, using XDG directory access only.
vi: Nếu truy cập home directory là hoàn toàn cần thiết, chỉ truy cập thư mục XDG.

source: The following permission options are available:
vi: Các tùy chọn quyền sau đây có sẵn:

source: ``:ro`` - read-only access
vi: ``:ro`` - truy cập chỉ đọc

source: ``:create`` - read/write access, and create the directory if it doesn't exist
vi: ``:create`` - truy cập đọc/viết và tạo thư mục nếu nó không tồn tại

source: Additionally the following permissions are available:
vi: Ngoài ra, các quyền sau đây cũng có sẵn:

source: Access to ``/home, /media, /opt, /run/media, /srv`` and everything provided by ``host-os, host-etc`` mounted in ``/run/host``
vi: Truy cập vào ``/home, /media, /opt, /run/media, /srv`` và mọi thứ được cung cấp bởi ``host-os, host-etc`` mounted trong ``/run/host``

source: Includes any subpaths
vi: Bao gồm bất kỳ đường dẫn con nào

source: Host's ``/etc``
vi: ``/etc`` của máy chủ

source: Host's ``/etc`` is mounted at ``/run/host/etc``
vi: ``/etc`` của máy chủ được mounted tại ``/run/host/etc``

source: Host's ``/usr, /bin, /sbin, /lib{32, 64}, /etc/ld.so.cache, /etc/alternatives``
vi: ``/usr, /bin, /sbin, /lib{32, 64}, /etc/ld.so.cache, /etc/alternatives`` của máy chủ

source: Mounted at ``/run/host``
vi: Được mounted tại ``/run/host``

source: Access the home directory
vi: Truy cập home directory

source: Except ``~/.var/app``
vi: Ngoại trừ ``~/.var/app``

source: Access an arbitrary path except any reserved path
vi: Truy cập một đường dẫn tùy ý ngoại trừ bất kỳ đường dẫn dành riêng (reserved path) nào

source: Arbitrary path relative to the home directory
vi: Đường dẫn tương đối so với home directory tùy ý

source: Access the XDG desktop directory
vi: Truy cập thư mục XDG desktop

source: ``$XDG_DESKTOP_DIR`` or ``$HOME/Desktop``
vi: ``$XDG_DESKTOP_DIR`` hoặc ``$HOME/Desktop``

source: Access the XDG documents directory
vi: Truy cập thư mục tài liệu XDG

source: ``$XDG_DOCUMENTS_DIR`` or ``$HOME/Documents``
vi: ``$XDG_DOCUMENTS_DIR`` hoặc ``$HOME/Documents``

source: Access the XDG download directory
vi: Truy cập thư mục tải xuống XDG

source: ``$XDG_DOWNLOAD_DIR`` or ``$HOME/Downloads``
vi: ``$XDG_DOWNLOAD_DIR`` hoặc ``$HOME/Downloads``

source: Access the XDG music directory
vi: Truy cập thư mục âm nhạc XDG

source: ``$XDG_MUSIC_DIR`` or ``$HOME/Music``
vi: ``$XDG_MUSIC_DIR`` hoặc ``$HOME/Music``

source: Access the XDG pictures directory
vi: Truy cập thư mục ảnh XDG

source: ``$XDG_PICTURES_DIR`` or ``$HOME/Pictures``
vi: ``$XDG_PICTURES_DIR`` hoặc ``$HOME/Pictures``

source: Access the XDG public directory
vi: Truy cập thư mục công cộng XDG

source: ``$XDG_PUBLICSHARE_DIR`` or ``$HOME/Public``
vi: ``$XDG_PUBLICSHARE_DIR`` hoặc ``$HOME/Public``

source: Access the XDG videos directory
vi: Truy cập thư mục video XDG

source: ``$XDG_VIDEOS_DIR`` or ``$HOME/Videos``
vi: ``$XDG_VIDEOS_DIR`` hoặc ``$HOME/Videos``

source: Access the XDG templates directory
vi: Truy cập thư mục mẫu XDG

source: ``$XDG_TEMPLATES_DIR`` or ``$HOME/Templates``
vi: ``$XDG_TEMPLATES_DIR`` hoặc ``$HOME/Templates``

source: Access the XDG config directory [#f3]_
vi: Truy cập thư mục cấu hình XDG [#f3]_

source: ``$XDG_CONFIG_HOME`` or ``$HOME/.config``
vi: ``$XDG_CONFIG_HOME`` hoặc ``$HOME/.config``

source: Access the XDG cache directory [#f3]_
vi: Truy cập thư mục bộ nhớ đệm XDG [#f3]_

source: ``$XDG_CACHE_HOME`` or ``$HOME/.cache``
vi: ``$XDG_CACHE_HOME`` hoặc ``$HOME/.cache``

source: Access the XDG data directory [#f3]_
vi: Truy cập thư mục dữ liệu XDG [#f3]_

source: ``$XDG_DATA_HOME`` or ``$HOME/.local/share``
vi: ``$XDG_DATA_HOME`` hoặc ``$HOME/.local/share``

source: Access subdirectories of the XDG runtime directory
vi: Truy cập các thư mục con của thư mục runtime XDG

source: Except ``host, host-etc, host-os`` paths can be added to all the above filesystem options. For example, ``--filesystem=xdg-documents/path``.
vi: Ngoại trừ ``host, host-etc, host-os``, các đường dẫn có thể được thêm vào tất cả các tùy chọn hệ thống tệp ở trên. Ví dụ: ``--filesystem=xdg-documents/path``.

source: Other filesystem access guidelines include:
vi: Các nguyên tắc truy cập hệ thống tệp khác bao gồm:

source: The ``--persist=DIR`` option can be used to map directories from the user's home directory into the sandbox filesystem. This only works if the application has no ``home`` or a broader permission like ``host`` that includes ``home``.
vi: Tùy chọn ``--persist=DIR`` có thể được sử dụng để ánh xạ (map) các thư mục từ home directory của người dùng vào hệ thống tệp hộp cát. Nó chỉ hoạt động nếu ứng dụng không có ``home`` hoặc một quyền rộng hơn (như ``host``) mà bao gồm ``home``.

source: For example, if an application hardcodes the directory ``~/.foo``, without any ``home`` access and no ``--persist`` the directory will be lost from the sandbox once exited due to the filesystem being set up as tmpfs by flatpak unless overriden. A ``--persist=.foo`` bind mounts ``~/.foo`` `inside the sandbox` to ``~/.var/app/$FLATPAK_ID/.foo`` on host thus allowing an app to persistently store data in ``~/.var/app/$FLATPAK_ID/.foo`` which would otherwise be lost.
vi: Ví dụ: nếu một ứng dụng hardcode thư mục ``~/.foo``, không có bất kỳ quyền truy cập ``home`` nào và không có `--persist`, thư mục này sẽ bị mất khỏi hộp cát sau khi thoát do hệ thống tệp được thiết lập dưới dạng tmpfs bởi flatpak trừ khi bị ghi đè. ``--persist=.foo`` sẽ mount ``~/.foo`` `bên trong hộp cát` thành ``~/.var/app/$FLATPAK_ID/.foo`` trên máy chủ, do đó cho phép ứng dụng lưu trữ dữ liệu lâu dài (persistent) trong ``~/.var/app/$FLATPAK_ID/.foo``, mà nếu không sẽ bị mất.

source: A ``--persist=.`` will `persist` all directories.
vi: ``--persist=.`` sẽ `persist` tất cả các thư mục.

source: This does not support ``:create, :ro, :rw`` suffixes or special values like ``xdg-documents``. However, the directory will be created by flatpak if it doesn't already exist.
vi: Nó không hỗ trợ các hậu tố ``:create, :ro, : rw`` hoặc các giá trị đặc biệt như ``xdg-documents``. Tuy nhiên, thư mục sẽ được tạo bởi flatpak nếu nó chưa tồn tại.

source: This makes it possible to avoid configuring access to the entire home directory, and can be useful for applications that hardcode file paths in ``~/``.
vi: Nó giúp tránh phải cấu hình truy cập vào toàn bộ home directory, và có thể hữu ích cho các ứng dụng mà hardcode các đường dẫn tệp trong ``~/``.

source: If an application uses ``$TMPDIR`` to contain lock files you may want to add a wrapper script that sets it to ``$XDG_RUNTIME_DIR/app/$FLATPAK_ID`` (tmpfs) or ``/var/tmp`` (persistent on host).
vi: Nếu một ứng dụng sử dụng ``$TMPDIR`` để chứa lock files (các tệp khóa), bạn có thể đặt nó thành ``$XDG_RUNTIME_DIR/app/$FLATPAK_ID`` (tmpfs) hoặc ``/var/tmp`` (lâu dài trên máy chủ) qua việc sử dụng một wrapper script.

source: Retaining and sharing configuration with non-Flatpak installations is to be avoided.
vi: Việc giữ lại và chia sẻ cấu hình với các ứng dụng không phải Flatpak là điều cần tránh.

source: Reserved Paths
vi: Các đường dẫn dành riêng (Reserved Paths)

source: The following paths are reserved for the runtime and Flatpak itself and are never shared::
vi: Các đường dẫn sau đây được dành riêng cho runtime và chính Flatpak và không bao giờ được chia sẻ::

source: Some subpaths of ``/run`` are allowed but not the entire directory.
vi: Một số đường dẫn con của ``/run`` được cho phép nhưng không phải toàn bộ thư mục.

source: Additionally the following directories from host need to be explicitly requested with ``--filesystem`` and are not available with ``home, host, host-os, host-etc`` by default:
vi: Ngoài ra, các thư mục sau đây từ máy chủ mà theo mặc định không được trao quyền truy cập qua ``home, host, host-os, host-etc`` thì cần được yêu cầu rõ ràng với ``--filesystem`` :

source: ``~/.var/app`` - The app can access only its own directory in ``~/.var/app/$FLATPAK_ID``
vi: ``~/.var/app`` - Ứng dụng chỉ có thể truy cập thư mục riêng của nó trong ``~/.var/app/$FLATPAK_ID``

source: ``/var`` - Note that by default ``/var/{cache, config, data, tmp}`` inside the sandbox are the same as ``~/.var/app/$FLATPAK_ID/{cache, config, data, cache/tmp}``. However an explicit ``--filesystem=/var`` will make only ``/var`` from host available and those will no longer be available.
vi: ``/var`` - Lưu ý rằng theo mặc định ``/var/{cache, config, data, tmp}`` bên trong hộp cát chính là ``~/.var/app/$FLATPAK_ID/{cache, config, data, cache/tmp}``. Tuy nhiên, sử dụng ``--filesystem=/var`` sẽ làm cho ``/var`` từ máy chủ có sẵn và vì thế các đường dẫn trên sẽ không còn khả dụng nữa.

source: ``/var/lib/flatpak`` - ``/var`` does not give access to this.
vi: ``/var/lib/flatpak`` - ``/var`` không cấp quyền truy cập cho thư mục này.

source: Device access
vi: Truy cập thiết bị

source: While not ideal, ``--device=all`` can be used to access devices like controllers or webcams.
vi: Mặc dù không lý tưởng, ``--device=all`` có thể được sử dụng để truy cập các thiết bị như bộ điều khiển (controller) hoặc webcam.

source: dconf access
vi: Truy cập dconf

source: As of xdg-desktop-portal 1.1.0 and glib 2.60.5 (in the runtime) you do not need direct DConf access in most cases.
vi: Kể từ xdg-desktop-portal 1.1.0 và glib 2.60.5 (trong runtime), bạn không cần quyền truy cập DConf trực tiếp trong hầu hết các trường hợp.

source: As of now this glib version is included in ``org.freedesktop.Platform//19.08`` and ``org.gnome.Platform//3.34`` and newer.
vi: Hiện tại, phiên bản glib này được bao gồm trong ``org.freedesktop.Platform//19.08`` và ``org.gnome.Platform//3.34`` và mới hơn.

source: If an application existed prior to these runtimes you can tell Flatpak (>= 1.3.4) to migrate the DConf settings on the host into the sandbox by adding ``--metadata=X-DConf=migrate-path=/org/example/foo/`` to ``finish-args``. The path must be similar to your app-id or it will not be allowed (case is ignored and ``_`` and ``-`` are treated equal).
vi: Nếu một ứng dụng tồn tại trước những runtime này, bạn có thể yêu cầu Flatpak (>= 1.3.4) di chuyển cài đặt DConf trên máy chủ vào hộp cát bằng cách thêm ``--metadata=X-DConf=migrate-path=/org/example/foo/`` vào ``finish-args``. Đường dẫn phải tương tự như định danh ứng dụng của bạn, nếu không sẽ không được cho phép (viết hoa hay viết thường, và ``_`` hay ``-`` là như nhau).

source: If you are targeting older runtimes or require direct DConf access for other reasons you can use these permissions::
vi: Nếu bạn đang nhắm đến runtime cũ hơn hoặc yêu cầu quyền truy cập DConf trực tiếp vì các lý do khác, bạn có thể sử dụng các quyền sau::

source: With those permissions glib will continue using dconf directly.
vi: Với những quyền đó, glib sẽ tiếp tục sử dụng dconf trực tiếp.

source: If you use a newer runtime where dconf is no longer built and still need it you will have to build the `dconf <https://download.gnome.org/sources/dconf/>`_ GIO module and set ``--env=GIO_EXTRA_MODULES=/app/lib/gio/modules/``.
vi: Nếu bạn sử dụng runtime mới hơn mà dconf không còn được xây dựng và bạn vẫn cần nó, bạn sẽ phải xây dựng mô-đun GIO `dconf <https://download.gnome.org/sources/dconf/>`_ và đặt ``--env=GIO_EXTRA_MODULES=/app/lib/gio/modules/``.

source: gvfs access
vi: Truy cập gvfs

source: As of gvfs 1.48, the gvfs daemons and applications use an on-disk socket to communicate, rather than an abstract socket so that the gvfs infrastructure still works when network support is disabled in the application's sandbox.
vi: Kể từ gvfs 1.48, các daemon (trình nền) và ứng dụng gvfs sử dụng on-disk socket để liên lạc thay vì một socket trừu tượng để gvfs vẫn hoạt động khi hỗ trợ mạng bị tắt trong hộp cát của ứng dụng.

source: A number of different options need to be passed depending on the application's use of gvfs.
vi: Một số tùy chọn khác nhau cần được đưa qua tùy thuộc vào cách của ứng dụng sử dụng gvfs.

source: ``--talk-name=org.gtk.vfs.*`` is necessary to talk to the gvfs daemons over D-Bus and list mounts using the GIO APIs.
vi: ``--talk-name=org.gtk.vfs.*`` là cần thiết để nói chuyện với các gvfs daemon qua D-Bus và liệt kê các mount bằng GIO API.
