Repository: harrmitch/flatpak-docs
Catalog: po/*/LC_MESSAGES/sandbox-permissions.po
Languages: vi

source: ``--filesystem=xdg-run/gvfsd`` is necessary to use the GIO APIs to list and access non-native files using the GIO APIs, using URLs rather than FUSE paths.
vi: ``--filesystem=xdg-run/gvfsd`` là cần thiết để sử dụng GIO API để liệt kê và truy cập các tệp non-native sử dụng URL thay vì đường dẫn FUSE.

source: ``--filesystem=xdg-run/gvfs`` is necessary to give access to the FUSE mounts non-GIO and legacy applications can use. This is what will make native files appear under ``/run/user/`id -u`/gvfs/``.
vi: ``--filesystem=xdg-run/gvfs`` là cần thiết để cấp quyền truy cập vào các mount FUSE mà các ứng dụng không phải GIO và các ứng dụng cũ (legacy) có thể sử dụng. Nó sẽ làm cho các tệp native xuất hiện trong ``/run/user/`id -u`/gvfs/``.

source: Typical GNOME and GTK applications should use::
vi: Các ứng dụng GNOME và GTK điển hình nên sử dụng::

source: Typical non-GNOME and non-GTK applications should use::
vi: Các ứng dụng không phải GNOME và không phải GTK điển hình nên sử dụng::

source: No application should be using ``--talk-name=org.gtk.vfs`` in its manifest, as there are no D-Bus services named ``org.gtk.vfs``.
vi: Không có ứng dụng nào nên sử dụng ``--talk-name=org.gtk.vfs`` trong tệp kê khai của nó, vì không có dịch vụ D-Bus nào có tên ``org.gtk.vfs``.

source: External drive access
vi: Truy cập ổ đĩa ngoài

source: External drives are mounted by the host system using systemd, udev, udisk fstab etc. and each of them can have different defaults. Flatpak has no control over how and where they get mounted. The following filesystem permissions should work in most cases::
vi: Ổ đĩa ngoài được mount bởi hệ thống máy chủ bằng cách sử dụng systemd, udev, udisk fstab, v.v. và từng cái có thể có các mặc định khác nhau. Flatpak không kiểm soát cách thức và nơi chúng được mount. Các quyền hệ thống tệp sau đây sẽ hoạt động trong hầu hết các trường hợp::

source: If ``--filesystem=host`` is used ``/media, /run/media`` is shared automatically if they exist.
vi: Nếu ``--filesystem=host`` được sử dụng, ``/media, /run/media`` được chia sẻ tự động nếu chúng tồn tại.

source: Note that these should not have subpaths in them unless the value of the subpath can be consistently pre-determined. Block device naming depends on the kernel/fstab configuration and cannot be pre-determined.
vi: Lưu ý rằng chúng không nên có đường dẫn con trong đó trừ khi giá trị của đường dẫn con có thể được xác định trước một cách nhất quán. Việc đặt tên thiết bị khối (block device) phụ thuộc vào cấu hình kernel/fstab và không thể được xác định trước.

source: Footnotes
vi: Chú thích

source: This is not necessarily required, but without it the X11 shared memory extension will not work, which is very bad for X11 performance.
vi: Nó không nhất thiết là bắt buộc, nhưng nếu không có nó, phần mở rộng bộ nhớ chia sẻ X11 sẽ không hoạt động, điều này rất xấu cho hiệu suất X11.

source: Giving network access also grants access to all host services listening on abstract Unix sockets (due to how network namespaces work), and these have no permission checks. This unfortunately affects e.g. the X server and the session bus which listens to abstract sockets by default. A secure distribution should disable these and just use regular sockets.
vi: Cấp quyền truy cập mạng cũng cấp quyền truy cập vào tất cả các dịch vụ máy chủ đang nghe trên các abstract Unix socket (do cách các namespace mạng hoạt động) và chúng không có kiểm tra quyền. Điều này không may ảnh hưởng đến ví dụ: máy chủ X và bus phiên đang nghe các abstract socket theo mặc định. Một bản phân phối an toàn nên vô hiệu hóa những thứ này và chỉ sử dụng các socket thông thường.

source: ``xdg-{cache, config, data}`` bind mounts the paths from host to the per-app sandbox directory. Inside the sandbox ``$XDG_CACHE_HOME``, ``$XDG_CONFIG_HOME`` and ``$XDG_DATA_HOME`` is set to ``$HOME/.var/app/$FLATPAK_ID/{cache, config, data}`` respectively. So for example, ``xdg-data/applications`` ie. ``$XDG_DATA_HOME/applications`` on host is bind mounted to ``$HOME/.var/app/$FLATPAK_ID/data/applications`` (inside the sandbox this is ``$XDG_DATA_HOME/applications``). Additionally it'll have two mount points - one expanded to ``$XDG_DATA_HOME/applications`` from the host and another to the sandbox's ``$XDG_DATA_HOME/applications`` ie. ``$HOME/.var/app/$FLATPAK_ID/data/applications``.
vi: ``xdg-{cache, config, data}`` mount các đường dẫn từ máy chủ đến thư mục hộp cát của mỗi ứng dụng. Bên trong hộp cát, ``$XDG_CACHE_HOME``, ``$XDG_CONFIG_HOME`` và ``$XDG_DATA_HOME`` tương ứng được đặt thành ``$HOME/.var/app/$FLATPAK_ID/{cache, config, data}``. Ví dụ: ``xdg-data/applications`` (hay chính là``$XDG_DATA_HOME/applications``) trên máy chủ được mount với ``$HOME/.var/app/$FLATPAK_ID/data/applications`` (bên trong sandbox đây là ``$XDG_DATA_HOME/applications``). Ngoài ra, nó sẽ có hai điểm mount (mount points) - một điểm được mở rộng thành ``$XDG_DATA_HOME/applications`` từ máy chủ và một điểm thành ``$XDG_DATA_HOME/applications`` (hay chính là ``$HOME/.var/app/$FLATPAK_ID/data/applications``).
